---
kind: method
id: M:Autodesk.Revit.DB.ExportPatternTable.GetPatternTableIterator
source: html/aff366de-86aa-a46a-06fd-38aa7ca0ed77.htm
---
# Autodesk.Revit.DB.ExportPatternTable.GetPatternTableIterator Method

Returns a PatternTableIterator that iterates through the collection.

## Syntax (C#)
```csharp
public ExportPatternTableIterator GetPatternTableIterator()
```

## Returns
A PatternTableIterator object that can be used to iterate through key-value pairs in the collection.